Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D22.svd
            <register>
               <name>HEOCFG38</name>
               <description>High-End Overlay Configuration Register 38</description>
               <addressOffset>0x00000424</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>YPHI5COEFF0</name>
                     <description>Vertical Coefficient for phase 5 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI5COEFF1</name>
                     <description>Vertical Coefficient for phase 5 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI5COEFF2</name>
                     <description>Vertical Coefficient for phase 5 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG39</name>
               <description>High-End Overlay Configuration Register 39</description>
               <addressOffset>0x00000428</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>YPHI6COEFF0</name>
                     <description>Vertical Coefficient for phase 6 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI6COEFF1</name>
                     <description>Vertical Coefficient for phase 6 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI6COEFF2</name>
                     <description>Vertical Coefficient for phase 6 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG40</name>
               <description>High-End Overlay Configuration Register 40</description>
               <addressOffset>0x0000042C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>YPHI7COEFF0</name>
                     <description>Vertical Coefficient for phase 7 tap 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI7COEFF1</name>
                     <description>Vertical Coefficient for phase 7 tap 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YPHI7COEFF2</name>
                     <description>Vertical Coefficient for phase 7 tap 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEOCFG41</name>
               <description>High-End Overlay Configuration Register 41</description>
               <addressOffset>0x00000430</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XPHIDEF</name>
                     <description>Horizontal Filter Phase Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>YPHIDEF</name>
                     <description>Vertical Filter Phase Offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCHER</name>
               <description>Post Processing Channel Enable Register</description>
               <addressOffset>0x00000540</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATEEN</name>
                     <description>Update Overlay Attributes Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QEN</name>
                     <description>Add To Queue Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCHDR</name>
               <description>Post Processing Channel Disable Register</description>
               <addressOffset>0x00000544</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCHSR</name>
               <description>Post Processing Channel Status Register</description>
               <addressOffset>0x00000548</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPIER</name>
               <description>Post Processing Interrupt Enable Register</description>
               <addressOffset>0x0000054C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPIDR</name>
               <description>Post Processing Interrupt Disable Register</description>
               <addressOffset>0x00000550</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPIMR</name>
               <description>Post Processing Interrupt Mask Register</description>
               <addressOffset>0x00000554</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPISR</name>
               <description>Post Processing Interrupt Status Register</description>
               <addressOffset>0x00000558</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>DMA Descriptor Loaded</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPHEAD</name>
               <description>Post Processing Head Register</description>
               <addressOffset>0x0000055C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HEAD</name>
                     <description>DMA Head Pointer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPADDR</name>
               <description>Post Processing Address Register</description>
               <addressOffset>0x00000560</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>DMA Transfer Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCTRL</name>
               <description>Post Processing Control Register</description>
               <addressOffset>0x00000564</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DFETCH</name>
                     <description>Transfer Descriptor Fetch Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAIEN</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCRIEN</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDIEN</name>
                     <description>Add Head Descriptor to Queue Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONEIEN</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPNEXT</name>
               <description>Post Processing Next Register</description>
               <addressOffset>0x00000568</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCFG0</name>
               <description>Post Processing Configuration Register 0</description>
               <addressOffset>0x0000056C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIF</name>
                     <description>Source Interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEN</name>
                     <description>AHB Burst Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DLBO</name>
                     <description>Defined Length Burst Only For Channel Bus Transaction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCFG1</name>
               <description>Post Processing Configuration Register 1</description>
               <addressOffset>0x00000570</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PPMODE</name>
                     <description>Post Processing Output Format Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PPMODESelect</name>
                        <enumeratedValue>
                           <name>PPMODE_RGB_16BPP</name>
                           <description>RGB 16 bpp</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PPMODE_RGB_24BPP_PACKED</name>
                           <description>RGB 24 bpp PACKED</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PPMODE_RGB_24BPP_UNPACKED</name>
                           <description>RGB 24 bpp UNPACKED</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PPMODE_YCBCR_422_MODE0</name>
                           <description>YCbCr 422 16 bpp (Mode 0)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PPMODE_YCBCR_422_MODE1</name>
                           <description>YCbCr 422 16 bpp (Mode 1)</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PPMODE_YCBCR_422_MODE2</name>
                           <description>YCbCr 422 16 bpp (Mode 2)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PPMODE_YCBCR_422_MODE3</name>
                           <description>YCbCr 422 16 bpp (Mode 3)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ITUBT601</name>
                     <description>Color Space Conversion Luminance</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCFG2</name>
               <description>Post Processing Configuration Register 2</description>
               <addressOffset>0x00000574</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XSTRIDE</name>
                     <description>Horizontal Stride</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCFG3</name>
               <description>Post Processing Configuration Register 3</description>
               <addressOffset>0x00000578</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSCYR</name>
                     <description>Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCYG</name>
                     <description>Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCYB</name>
                     <description>Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCYOFF</name>
                     <description>Color Space Conversion Luminance Offset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PPCFG4</name>
               <description>Post Processing Configuration Register 4</description>
               <addressOffset>0x0000057C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSCUR</name>
                     <description>Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCUG</name>
                     <description>Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCUB</name>
                     <description>Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSCUOFF</name>
                     <description>Color Space Conversion Chrominance B Offset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
