Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D22.svd
            <register>
               <name>LPR</name>
               <description>Low-Power Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPCB</name>
                     <description>Low-power Command Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>LPCBSelect</name>
                        <enumeratedValue>
                           <name>NOLOWPOWER</name>
                           <description>Low-power feature is inhibited. No Powerdown, Self-refresh and Deep power modes are issued to the DDR-SDRAM device.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELFREFRESH</name>
                           <description>The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POWERDOWN</name>
                           <description>The MPDDRC issues a Powerdown command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Powerdown mode when accessed and reenters it after the access.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEEPPOWERDOWN</name>
                           <description>The MPDDRC issues a Deep Powerdown command to the low-power DDR-SDRAM device.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK_FR</name>
                     <description>Clock Frozen Command Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CLK_FRSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Clock(s) is/are not frozen.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Clock(s) is/are frozen.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPDDR2_LPDDR3_PWOFF</name>
                     <description>LPDDR2 - LPDDR3 Power Off Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPDDR2_LPDDR3_PWOFFSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>No power-off sequence applied to LPDDR2/LPDDR3.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>A power-off sequence is applied to the LPDDR2/LPDDR3 device. CKE is forced low.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PASR</name>
                     <description>Partial Array Self-refresh</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Drive Strength</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DSSelect</name>
                        <enumeratedValue>
                           <name>DS_FULL</name>
                           <description>Full drive strength</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_HALF</name>
                           <description>Half drive strength</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_QUARTER</name>
                           <description>Quarter drive strength</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_OCTANT</name>
                           <description>Octant drive strength</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Time Between Last Transfer and Low-Power Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TIMEOUTSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>SDRAM Low-power mode is activated immediately after the end of the last transfer.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELAY_64_CLK</name>
                           <description>SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DELAY_128_CLK</name>
                           <description>SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>APDE</name>
                     <description>Active Power Down Exit Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>APDESelect</name>
                        <enumeratedValue>
                           <name>DDR2_FAST_EXIT</name>
                           <description>Fast Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_SLOW_EXIT</name>
                           <description>Slow Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPD_MR</name>
                     <description>Update Load Mode Register and Extended Mode Register</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>UPD_MRSelect</name>
                        <enumeratedValue>
                           <name>NO_UPDATE</name>
                           <description>Update of Load Mode and Extended Mode registers is disabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_SHAREDBUS</name>
                           <description>MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_NOSHAREDBUS</name>
                           <description>MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHG_FRQ</name>
                     <description>Change Clock Frequency During Self-refresh Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELF_DONE</name>
                     <description>Self-refresh is done (read-only)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MD</name>
               <description>Memory Device Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MD</name>
                     <description>Memory Device</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MDSelect</name>
                        <enumeratedValue>
                           <name>LPDDR_SDRAM</name>
                           <description>Low-power DDR1-SDRAM</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR3_SDRAM</name>
                           <description>DDR3-SDRAM</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPDDR3_SDRAM</name>
                           <description>Low-power DDR3-SDRAM</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_SDRAM</name>
                           <description>DDR2-SDRAM</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPDDR2_SDRAM</name>
                           <description>Low-power DDR2-SDRAM</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>DBW_32_BITS</name>
                           <description>Data bus width is 32 bits</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBW_16_BITS</name>
                           <description>Data bus width is 16 bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WL</name>
                     <description>Write Latency (read-only)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WLSelect</name>
                        <enumeratedValue>
                           <name>WL_SETA</name>
                           <description>Write Latency Set A</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WL_SETB</name>
                           <description>Write Latency Set B</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RL3</name>
                     <description>Read Latency 3 Option Support (read-only)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RL3Select</name>
                        <enumeratedValue>
                           <name>RL3_SUPPORT</name>
                           <description>Read latency of 3 is supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL3_NOT_SUPPORTED</name>
                           <description>Read latency 0f 3 is not supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MANU_ID</name>
                     <description>Manufacturer Identification (read-only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision Identification (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>DRAM Architecture (read-only)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TYPESelect</name>
                        <enumeratedValue>
                           <name>S4_SDRAM</name>
                           <description>4n prefetch architecture</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>S2_SDRAM</name>
                           <description>2n prefetch architecture</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NVM</name>
                           <description>Non-volatile device</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>S8_SDRAM</name>
                           <description>8n prefetch architecture</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DENSITY</name>
                     <description>Density of Memory (read-only)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>DENSITYSelect</name>
                        <enumeratedValue>
                           <name>DENSITY_64MBITS</name>
                           <description>The device density is 64 Mbits.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_128MBITS</name>
                           <description>The device density is 128 Mbits.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_256MBITS</name>
                           <description>The device density is 256 Mbits.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_512MBITS</name>
                           <description>The device density is 512 Mbits.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_1GBITS</name>
                           <description>The device density is 1 Gbit.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_2GBITS</name>
                           <description>The device density is 2 Gbits.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_4GBITS</name>
                           <description>The device density is 4 Gbits.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_8GBITS</name>
                           <description>The device density is 8 Gbits.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_16GBITS</name>
                           <description>The device density is 16 Gbits.</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DENSITY_32GBITS</name>
                           <description>The device density is 32 Gbits.</description>
                           <value>0x9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IO_WIDTH</name>
                     <description>Width of Memory (read-only)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>IO_WIDTHSelect</name>
                        <enumeratedValue>
                           <name>WIDTH_32</name>
                           <description>The data bus width is 32 bits.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WIDTH_16</name>
                           <description>The data bus width is 16 bits.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WIDTH_8</name>
                           <description>The data bus width is 8 bits.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_USED</name>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR23_LPR</name>
               <description>Low-power DDR2 Low-power DDR3 Low-power Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BK_MASK_PASR</name>
                     <description>Bank Mask Bit/PASR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SEG_MASK</name>
                     <description>Segment Mask Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DS</name>
                     <description>Drive Strength</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>DSSelect</name>
                        <enumeratedValue>
                           <name>DS_34_3</name>
                           <description>34.3 ohm typical</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_40</name>
                           <description>40 ohm typical (default)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_48</name>
                           <description>48 ohm typical</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_60</name>
                           <description>60 ohm typical</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_80</name>
                           <description>80 ohm typical</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DS_120</name>
                           <description>120 ohm typical</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
