Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D22.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SCKC</name>
         <version>11073G</version>
         <description>Slow Clock Controller</description>
         <groupName>SCKC</groupName>
         <prependToName>SCKC_</prependToName>
         <baseAddress>0xF8048050</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <description>Slow Clock Controller Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OSCSEL</name>
                     <description>Slow Clock Selector</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OSCSELSelect</name>
                        <enumeratedValue>
                           <name>RC</name>
                           <description>Slow clock is the embedded 64 kHz (typical) RC oscillator.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTAL</name>
                           <description>Slow clock is the 32.768 kHz crystal oscillator.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SDMMC1</name>
         <version>44002H</version>
         <description>Secure Digital MultiMedia Card Controller</description>
         <groupName>SDMMC</groupName>
         <prependToName>SDMMC_</prependToName>
         <baseAddress>0xB0000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x244</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SDMMC1</name>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>SDMMC1_TIMER</name>
            <value>72</value>
         </interrupt>
         <registers>
            <register>
               <name>SSAR</name>
               <description>SDMA System Address / Argument 2 Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>SDMA System Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
                  <field>
                     <name>ARG2</name>
                     <description>Argument 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BSR</name>
               <description>Block Size Register</description>
               <addressOffset>0x04</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>BLKSIZE</name>
                     <description>Transfer Block Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>BOUNDARY</name>
                     <description>SDMA Buffer Boundary</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>BOUNDARYSelect</name>
                        <enumeratedValue>
                           <name>_4K</name>
                           <description>4-Kbyte boundary</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8K</name>
                           <description>8-Kbyte boundary</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16K</name>
                           <description>16-Kbyte boundary</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32K</name>
                           <description>32-Kbyte boundary</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64K</name>
                           <description>64-Kbyte boundary</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128K</name>
                           <description>128-Kbyte boundary</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256k</name>
                           <description>256-Kbyte boundary</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512K</name>
                           <description>512-Kbyte boundary</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCR</name>
               <description>Block Count Register</description>
               <addressOffset>0x06</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>BLKCNT</name>
                     <description>Block Count for Current Transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARG1R</name>
               <description>Argument 1 Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ARG1</name>
                     <description>Argument 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TMR</name>
               <description>Transfer Mode Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DMAENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>DMA functionality is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>DMA functionality is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BCEN</name>
                     <description>Block Count Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BCENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Block count is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Block count is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDEN</name>
                     <description>Auto Command Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ACMDENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Auto Command Disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMD12</name>
                           <description>Auto CMD12 Enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMD23</name>
                           <description>Auto CMD23 Enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTDSEL</name>
                     <description>Data Transfer Direction Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DTDSELSelect</name>
                        <enumeratedValue>
                           <name>WRITE</name>
                           <description>Writes data from the SDMMC to the device.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READ</name>
                           <description>Reads data from the device to the SDMMC.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSBSEL</name>
                     <description>Multi/Single Block Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <description>Command Register</description>
               <addressOffset>0x0E</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>RESPTYP</name>
                     <description>Response Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RESPTYPSelect</name>
                        <enumeratedValue>
                           <name>NORESP</name>
                           <description>No Response</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL136</name>
                           <description>Response Length 136</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL48</name>
                           <description>Response Length 48</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL48BUSY</name>
                           <description>Response Length 48 with Busy</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDCCEN</name>
                     <description>Command CRC Check Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDCCENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The Command CRC Check is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The Command CRC Check is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDICEN</name>
                     <description>Command Index Check Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDICENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The Command Index Check is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The Command Index Check is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPSEL</name>
                     <description>Data Present Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDTYP</name>
                     <description>Command Type</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMDTYPSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Other commands</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUSPEND</name>
                           <description>CMD52 to write 'Bus Suspend' in the Card Common Control Registers (CCCR) (for SDIO only)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESUME</name>
                           <description>CMD52 to write 'Function Select' in the Card Common Control Registers (CCCR) (for SDIO only)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORT</name>
                           <description>CMD12, CMD52 to write 'I/O Abort' in the Card Common Control Registers (CCCR) (for SDIO only)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDIDX</name>
                     <description>Command Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>RR[%s]</name>
               <description>Response Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMDRESP</name>
                     <description>Command Response</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDPR</name>
               <description>Buffer Data Port Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BUFDATA</name>
                     <description>Buffer Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSR</name>
               <description>Present State Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMDINHC</name>
                     <description>Command Inhibit (CMD)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDINHD</name>
                     <description>Command Inhibit (DAT)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLACT</name>
                     <description>DAT Line Active</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WTACT</name>
                     <description>Write Transfer Active</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTACT</name>
                     <description>Read Transfer Active</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUFWREN</name>
                     <description>Buffer Write Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUFRDEN</name>
                     <description>Buffer Read Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARDINS</name>
                     <description>Card Inserted</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARDSS</name>
                     <description>Card State Stable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARDDPL</name>
                     <description>Card Detect Pin Level</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRPPL</name>
                     <description>Write Protect Pin Level</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATLL</name>
                     <description>DAT[3:0] Line Level</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CMDLL</name>
                     <description>CMD Line Level</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
